snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ЛистСборкиКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистСборкиКомплектовЧЗ</name>
  <comment>Лист сборки комплектов маркированого товара </comment>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фРежим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СборщикКомплектаТСД</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>КодКомплектаПодтвержденСканированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКомплекта</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияКомплекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/СтатусыКМ_Факт_А.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_А</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиДоступныхКМ/ОстаткиДоступныхКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДоступныхКМ</name>
  <resources>
    <name>ЭмитированноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Нанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/ОтгружаемыеКодыМаркировки/ОтгружаемыеКодыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтгружаемыеКодыМаркировки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Единицы/Единицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Единицы</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ОКЕИ</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ObjectModule.bsl
#Область СобытияОбъекта

// Чирков 
//	1. Перестаньте корежить процедуры - есть штатный метод "Заполнить"
//	2. Подразделение по умолчанию вынесено в общую процедуру заполнения шапки
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);	   
	
	// Кельманов А.В. - HELP-9912 - 2026.05.26 {
	Если ЗначениеЗаполнено(Автор) Тогда
		СборщикКомплектаТСД = Автор.ФизЛицо;
	КонецЕсли;
	// Кельманов А.В. - HELP-9912 - 2026.05.26 }	         
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	    ДокОснование = МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокОснование");		
		фРежим		 = МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "фРежим");
		Если фРежим = 2  Тогда
			Продукция	 = МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "Продукция");
		КонецЕсли;
	Иначе
		ДокОснование = ДанныеЗаполнения;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;	
	
	ТипОснования = ТипЗнч(ДокОснование);	
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
		ЗаполнитьПоЗСБ();			
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДополнительныеСвойства.Свойство("НеПроверятьШтрихКодНабора") Тогда
		Если ПроверяемыеРеквизиты.Свойство() Тогда
					
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ШККомплектов = Новый Соответствие;
	Для Каждого СтрокаТЧ из ШтрихкодыУпаковок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКомплекта) Тогда Продолжить КонецЕсли;
		
		//Статус КМ набора
		Если ШККомплектов[СтрокаТЧ.ШтрихкодКомплекта] = Неопределено Тогда 			
			ШККомплектов[СтрокаТЧ.ШтрихкодКомплекта] = Истина;
			
			Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
			Движение.Период				= ?(ЗначениеЗаполнено(СтрокаТЧ.ДатаФормированияКомплекта), СтрокаТЧ.ДатаФормированияКомплекта, Дата);
			Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодКомплекта;		
			Движение.Местонахождение	= Подразделение;
			
			Если СтрокаТЧ.КодКомплектаПодтвержденСканированием Тогда
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;					
			Иначе
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;			
			КонецЕсли;		
		КонецЕсли;
		
		//Статус КМ комплектующего
		Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) Тогда
			ДатаЗаписи	 = ?(ЗначениеЗаполнено(СтрокаТЧ.ДатаФормированияКомплекта), СтрокаТЧ.ДатаФормированияКомплекта, Дата);
			
			Если СтрокаТЧ.КодКомплектующегоНеНанесен Тогда
				Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
				Движение.Период				= ДатаЗаписи - 1;
				Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;		
				Движение.Местонахождение	= Подразделение;
				Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально;							
			КонецЕсли;
			
			Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
			Движение.Период				= ДатаЗаписи;
			Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;		
			Движение.Местонахождение	= Подразделение;
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Вложен;
		КонецЕсли; 
	КонецЦикла;
	
	//+++Чирков 2025.04.29
	//тов. Крохин очень переживает что мои "гипотетические" оптимизации мешают ему проводить документы
	//впрочем, как обычно, звон есть а ни подтверждений ни понимания сути проблемы нет
	Если ШтрихкодыУпаковок.Количество() = 0 Тогда
		Движения.СтатусыКМ_Факт.Очистить();	
		Движения.СтатусыКМ_Факт_А.Очистить();
		Движения.ОстаткиДоступныхКМ.Очистить();
	КонецЕсли; 
	//---Чирков 2025.04.29
	
	Если Завершен И ВсеНаборыСобраны() Тогда		
		Если ПолучитьРеквизитШапки(ДокОснование, "СостояниеНакладной") <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗавершитьЗадание(ДокОснование);
			#ЕСЛИ КЛИЕНТ ТОГДА
				ОповеститьОбИзменении(ДокОснование);
			#КОНЕЦЕСЛИ	
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор 		= ПараметрыСеанса.Пользователь;
	Комментарий = "";	
	Завершен   	= Ложь;
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;	
	//ОбновитьСтатусыНанесения();
		
	Если Модифицированность() Тогда
		
		Если фРежим = 2 Тогда //Пакетный режим
		Иначе
			
			// Кельманов А.В. - HELP-5254 - 2026.03.30 {
			//КоличествоДокумента = КоличествоКомплектов();
			//рПроверки = ЭтоМоноКомплектация();
			//Продукция = рПроверки.Данные; 
			КоличествоКомплектов = КоличествоКомплектов();
			
			Если КоличествоКомплектов > 0 Или Не ЗначениеЗаполнено(Продукция) Или Не фРежим = 0 Тогда
				
				КоличествоДокумента = КоличествоКомплектов;
				рПроверки = ЭтоМоноКомплектация();
				Продукция = рПроверки.Данные;
				
			КонецЕсли;
			// Кельманов А.В. - HELP-5254 - 2026.03.30 }

		КонецЕсли;
		
		КоличествоКомплектующих = ШтрихкодыУпаковок.Количество();
		
		Если КоличествоДокумента > 0 тогда
			ЗаполнитьТоварыПоКМ(ЭтотОбъект);
		КонецЕсли;
		
		ГруппыТоваров = ГруппыТоваровДокумента(ЭтотОбъект);
		
	КонецЕсли;	
	
	Если РабочееМесто.Пустая() Тогда
		Если ЗначениеЗаполнено(УзелТСД) Тогда
			РабочееМесто = Справочники.РабочиеМеста.ПолучитьРабочееМестоПоУзлу(УзелТСД);								
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; 
	
	рПроверки = Документы.ЛистСборкиКомплектовЧЗ.ПроверитьДублиКодовКомплектов(Ссылка);
	Если НЕ рПроверки.Успешно Тогда		
		Отказ = Истина;
		ВызватьИсключение СтрСоединить(рПроверки.Ошибки, Символы.ПС);
	КонецЕсли; 
	
	Если Завершен И Проведен Тогда
		Если НЕ РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуПроверкиДокумента(Ссылка);			
		КонецЕсли;
		//+++Чирков 01.06.2026 MARK-3589
		//Валетов+ 10.06.2026 Проблема 0000000080   
		//Пока Отключим проверку 
		//МаркировкаС.ПроверитьКМпоДокументу(Ссылка, Новый Структура("ОтложеннаяПроверка", Истина));
		//Валетов -
		//---Чирков 01.06.2026
	//+++Чирков 27.02.2026 очистка записей при откате завершенного документа	
	Иначе         		
		Если РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.УдалитьЗаписиПоДокументу(Ссылка);			
		КонецЕсли;		
	//---Чирков 27.02.2026 очистка записей при откате завершенного документа		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

Функция ЭтоМоноКомплектация()
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Владелец КАК Продукция
	|ИЗ 
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКодов)
	|	И НЕ Владелец.ВерсияДанных ЕСТЬ NULL
	|";
	
	МассивКодов = ШтрихкодыУпаковок.Выгрузить( , "ШтрихкодКомплекта");
	МассивКодов.Свернуть("ШтрихкодКомплекта");
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов.ВыгрузитьКолонку("ШтрихкодКомплекта"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.Продукция) Тогда	
			Результат.Данные	= Выборка.Продукция;			
			Результат.Успешно	= Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЭтоМоноКомплектация() 

Функция ВсеНаборыСобраны()
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(КолСобрано) КАК КолСобрано,
	|	СУММА(КолЗадание) КАК КолЗадание
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		Количество*Коэффициент	КАК КолСобрано,
	|		0						КАК КолЗадание
	|	ИЗ
	|		Документ.ЛистСборкиКомплектовЧЗ.Товары КАК ЛистСборкиКомплектовЧЗТовары
	|	ГДЕ
	|		Ссылка.ДокОснование = &ДокОснование
	|		И Ссылка.Проведен И Ссылка.Завершен	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		0						КАК КолСобрано,
	|		Количество*Коэффициент	КАК КолЗадание
	|	ИЗ
	|		Документ.ЗаданиеНаСборкуКомплектовЧЗ.Товары
	|	ГДЕ
	|		Ссылка = &ДокОснование
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(КолСобрано)<>СУММА(КолЗадание)
	|";	
			
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);			
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ВсеНаборыСобраны() 

Функция КоличествоКомплектов()
	ШККомплектов = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКомплекта) Тогда
			ШККомплектов[СтрокаТЧ.ШтрихкодКомплекта] = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ШККомплектов.Количество();
КонецФункции //КоличествоКомплектов() 

Функция ЗаполнитьПоЗСБ()
	
КонецФункции //ЗаполнитьПоРНК()

Функция ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КМ.ШтрихкодКомплекта.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Ссылка)				КАК Единица,
	|	МАКСИМУМ(Коэффициент)			КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Единицы
	|ИЗ
	|	ВТ_КМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.Единицы КАК Единицы
	|ПО
	|	Единицы.Владелец = ВТ_КМ.ШтрихкодКомплекта.Владелец
	|	И Единицы.ОКЕИ = ВТ_КМ.ШтрихкодУпаковки.Владелец.БазоваяЕдиница	
	|	И НЕ Единицы.ПометкаУдаления
	|ГДЕ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КМ.ШтрихкодКомплекта.Владелец
	|;	
	|ВЫБРАТЬ
	|	ВТ_КМ.ШтрихкодКомплекта.Владелец 		КАК Номенклатура,
	|	МАКСИМУМ(ВТ_Единицы.Единица)			КАК Единица,
	|	МАКСИМУМ(ВТ_Единицы.Коэффициент)		КАК Коэффициент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКомплекта)	КАК Количество
	|ИЗ
	|	ВТ_КМ	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Единицы
	|ПО
	|	ВТ_Единицы.Номенклатура = ШтрихкодКомплекта.Владелец
	|ГДЕ
	|	ШтрихкодКомплекта.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодКомплекта.Владелец
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКомплекта.Владелец.Наименование
	|";	
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ДокОбъект.ШтрихкодыУпаковок);
	
	ДокОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции //ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт

Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры
